Revit 2027 API
Stairs.GetStairsLandings Method
 Returns all the stairs landing components in the stairs.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetStairsLandings()
Public Function GetStairsLandings As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetStairsLandings()
member GetStairsLandings : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
 The stairs landing components in the stairs.
Example
private void GetStairLandings(Stairs stairs)
{
    ICollection<ElementId> landingIds = stairs.GetStairsLandings();
    string info = "Number of landings:  " + landingIds.Count;
    int landingIndex = 0;
    foreach (ElementId landingId in landingIds)
    {
        landingIndex++;
        StairsLanding landing = stairs.Document.GetElement(landingId) as StairsLanding;
        if (null != landing)
        {
            info += "\nThickness of Landing " + landingIndex + ":  " + landing.Thickness;
        }
    }
    TaskDialog.Show("Revit", info);
}
See Also
Reference
Stairs Class
Autodesk.Revit.DB.Architecture Namespace